//ВстариваниеВКонфуУТ11 2024
&НаКлиенте
процедура ЗавершениеПечатиЧека(РезультатПечатиЧекаНаККТ, ДопПараметры) экспорт
	Перем ОписаниеОшибки;
	//ДопПараметры - пустые, не понятно какая информация может нам понадоится
	Сообщить("ЗавершениеПечатиЧека с реузльатом" + СокрЛП(РезультатПечатиЧекаНаККТ));

	ОписаниеОшибки = "";
	резЗакрытияФормыПредваритПросмЧека = ИСТИНА;
	Если РезультатПечатиЧекаНаККТ = НЕОПРЕДЕЛЕНО тогда
		ОписаниеОшибки = "Печать чека отменена пользователем";
		резЗакрытияФормыПредваритПросмЧека = ЛОЖЬ;
	иначеЕсли Не РезультатПечатиЧекаНаККТ.Результат тогда
		резЗакрытияФормыПредваритПросмЧека = ЛОЖЬ;
		ОписаниеОшибки = РезультатПечатиЧекаНаККТ.ОписаниеОшибки;
	конецЕсли;
	//Если НЕ резЗакрытияФормыПредваритПросмЧека тогда
	//	//пользователь отменил печать чека
	//	стрОписаниеОшибки = "Печать чека отменена пользователем";
	//	стрРезПечатиЧека.Вставить("Результат", ЛОЖЬ);
	//	стрРезПечатиЧека.Вставить("КодОшибки", -2);
	//	стрРезПечатиЧека.Вставить("описаниеОшибки", стрОписаниеОшибки);
	//	стрРезПечатиЧека.Вставить("COMДрайверККТ10", всеПараметрыЧека.COMДрайверККТ10);
	//	ВыполнитьОбработкуОповещения(всеПараметрыЧека.ОповещениеПослеПечатиЧека, стрРезПечатиЧека);
	//	Возврат;	
	//	//если печать чека отменена пользловатлем
	//иначеЕсли резЗакрытияПредварительногоПросмотраЧека.Свойство("ТаблицаОплат") тогда
	//	//меням суммы оплат
	//	//ЗаполнитьНовымиСуммамиОплат(всеПараметрыЧека.списПараметровЧека, резЗакрытияПредварительногоПросмотраЧека.ТаблицаОплат);
	//	для Каждого стрОплатНовые из резЗакрытияПредварительногоПросмотраЧека.ТаблицаОплат цикл
	//		всеПараметрыЧека.списПараметровЧека.Вставить(стрОплатНовые.Ключ, стрОплатНовые.Значение);
	//	конецЦикла;			
	//конецЕсли;
			
	Если резЗакрытияФормыПредваритПросмЧека Тогда
		// Установить полученное значение номера чека реквизиту документа.
		Объект.НомерЧекаККМ = РезультатПечатиЧекаНаККТ.НомерЧека;
		Модифицированность = Истина;
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	Иначе
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
									|Чек не напечатан на фискальном регистраторе.
									|Дополнительное описание:
									|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,
									 "%ДополнительноеОписание%",
									 ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
конецПроцедуры //ЗавершениеПечатиЧека

//ВстариваниеВКонфуУТ11 2024 --

&НаКлиенте
Процедура ПредложитьВыбратьУстройствоЗавершение(ИдентификаторУстройства, ДополнительныеПараметры) Экспорт
	
	ОписаниеОшибки = "";
	
	Если ИдентификаторУстройства <> Неопределено Тогда
		Сообщить("Вставка кода для печти");
		//ВстариваниеВКонфуУТ11 2024
		//формаДокумента = ОткрытьФормуДокументаИзКоторогоБудетПечататьсяЧек();
		//скорее всего здесь надо вставить ссылку на процедуру обработки результата пеачти чека в модуле документа
   		ОповещениеПриЗавершенииПечатиЧека = Новый ОписаниеОповещения("ЗавершениеПечатиЧека", ЭтотОбъект);
		Если ПодключаемоеОборудованиеУниверсальныйДрайверКлиент.ПечатьЧекаНаККТВместоВстроеннойВКонфигурацию(
				Объект.Ссылка, ОповещениеПриЗавершенииПечатиЧека, ЭтаФорма)
		тогда
			Сообщить("Вставка кода для печти --");
			Возврат; //
		конецЕсли;
		//ВстариваниеВКонфуУТ11 2024 --
		
		
		// Подключаем ФР
		Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
