#Область ВстариваниеВКонфуУТ11
функция ПолчитьИмяОбработкиДляПечатиЧека()
	//"C:\docum\fl\utAtol\НастройкаСвязисККТ_fl.epf"
	Сообщить("Процедура ПолчитьИмяОбработкиДляПечатиЧека");									
	возврат "C:\docum\fl\utAtol\ПечатьЧекаККТВнеКонфигурации.epf";
конецФункции //ПолчитьИмяОбработкиДляПечатиЧека

Функция ПечатьЧекаНаККТВместоВстроеннойВКонфигурацию(докСсылкаПоКоторомуПечатаемЧек, 
									ОповещениеПриЗавершенииПечатиЧека, ФормаДокумента) экспорт
	//"C:\docum\fl\utAtol\НастройкаСвязисККТ_fl.epf"									
	Сообщить("Процедура ПечатьЧекаНаККТВместоВстроеннойВКонфигурацию начало");
	имяОбработкиДляПечатиЧека = ПолчитьИмяОбработкиДляПечатиЧека();
	допПараметры = Новый Структура;
	допПараметры.Вставить("ФормаДокум", ФормаДокумента);
	//проуедура обрабатывающая результат печти чека - она находится в модуле формы документа
	допПараметры.Вставить("ОповещениеПриЗавершенииПечатиЧека", ОповещениеПриЗавершенииПечатиЧека);
	//данные необходимые для формирования чека
	допПараметры.Вставить("докСсылкаПоКоторомуПечатаемЧек", докСсылкаПоКоторомуПечатаемЧек);
    ОбработкаОкончанияПомещения = Новый ОписаниеОповещения
        ("ОбработчикОкончанияПомещения", ЭтотОбъект, допПараметры);    
    НачатьПомещениеФайла(ОбработкаОкончанияПомещения, , 
        имяОбработкиДляПечатиЧека, Ложь, ФормаДокумента.УникальныйИдентификатор);	
	Сообщить("ПечатьЧекаНаККТВместоВстроеннойВКонфигурацию конец");
	возврат ИСТИНА;
	//если вернём ложь, то продолжится стандартная обработка печати чека конфигурации
КонецФункции //ПечатьЧекаНаККТВместоВстроеннойВКонфигурацию ()

Процедура ОбработчикОкончанияПомещения(Результат, Адрес, 
        ВыбранноеИмяФайла, ДополнительныеПараметры) экспорт
	Сообщить("Процедура ОбработчикОкончанияПомещения");
	Если НЕ Результат Тогда
		Сообщить("Процедура ОбработчикОкончанияПомещения --");
        Сообщить("Не удалось открыть обработку печати чека");
		возврат;
	КонецЕсли; 
	имяОбр = МенеджерОборудованияВызовСервера.ПолучитьИмяВнешнейОбработки(Адрес);	
	ПарамДляФормы = Новый Структура;
	//передаём данные на основе которых можно было бы сформировать чека
	ПарамДляФормы.Вставить("докСсылкаПоКоторомуПечатаемЧек", ДополнительныеПараметры.докСсылкаПоКоторомуПечатаемЧек);
	////передаём форму документа, что спразу же во внешней обработке её модифицировать (записать номер чека)
	//ПарамДляФормы.Вставить("ФормаДокум", ДополнительныеПараметры.ФормаДокум);
	//при закрытии формы документа, форма печати чека тоже закроется
	ФормаОжиданияОтвета = ПолучитьФорму("ВнешняяОбработка."+имяОбр+".Форма.Форма", ПарамДляФормы, ДополнительныеПараметры.ФормаДокум);
	//после закрытия формы печати чека - вызывает процедуру обработки результата печати чека
	ФормаОжиданияОтвета.ОписаниеОповещенияОЗакрытии = ДополнительныеПараметры.ОповещениеПриЗавершенииПечатиЧека;
	//открываем форму, которая нам напечатает чек
	ФормаОжиданияОтвета.Открыть();	
	Сообщить("Процедура ОбработчикОкончанияПомещения --");
КонецПроцедуры //ОбработчикОкончанияПомещения

#КонецОбласти   
